study12/tools/loadtest/results/study12_after__hot-post-view-comments100__capacity__run-01__k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hot-post-view.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * hot_post_view: Up to 1000.00 iterations/s for 1m20s over 4 stages (maxVUs: 100-1000, gracefulStop: 10s)


running (0m01.0s), 0001/0100 VUs, 196 complete and 0 interrupted iterations
hot_post_view   [   1% ] 0001/0100 VUs  0m01.0s/1m20s  0200.00 iters/s

running (0m02.0s), 0001/0100 VUs, 396 complete and 0 interrupted iterations
hot_post_view   [   2% ] 0001/0100 VUs  0m02.0s/1m20s  0200.00 iters/s

running (0m03.0s), 0001/0100 VUs, 596 complete and 0 interrupted iterations
hot_post_view   [   4% ] 0001/0100 VUs  0m03.0s/1m20s  0200.00 iters/s

running (0m04.0s), 0001/0100 VUs, 796 complete and 0 interrupted iterations
hot_post_view   [   5% ] 0001/0100 VUs  0m04.0s/1m20s  0200.00 iters/s

running (0m05.0s), 0001/0100 VUs, 996 complete and 0 interrupted iterations
hot_post_view   [   6% ] 0001/0100 VUs  0m05.0s/1m20s  0200.00 iters/s

running (0m06.0s), 0001/0100 VUs, 1196 complete and 0 interrupted iterations
hot_post_view   [   7% ] 0001/0100 VUs  0m06.0s/1m20s  0200.00 iters/s

running (0m07.0s), 0001/0100 VUs, 1396 complete and 0 interrupted iterations
hot_post_view   [   9% ] 0001/0100 VUs  0m07.0s/1m20s  0200.00 iters/s

running (0m08.0s), 0001/0100 VUs, 1596 complete and 0 interrupted iterations
hot_post_view   [  10% ] 0001/0100 VUs  0m08.0s/1m20s  0200.00 iters/s

running (0m09.0s), 0001/0100 VUs, 1796 complete and 0 interrupted iterations
hot_post_view   [  11% ] 0001/0100 VUs  0m09.0s/1m20s  0200.00 iters/s

running (0m10.0s), 0002/0100 VUs, 1995 complete and 0 interrupted iterations
hot_post_view   [  12% ] 0002/0100 VUs  0m10.0s/1m20s  0200.00 iters/s

running (0m11.0s), 0000/0100 VUs, 2197 complete and 0 interrupted iterations
hot_post_view   [  14% ] 0000/0100 VUs  0m11.0s/1m20s  0200.00 iters/s

running (0m12.0s), 0000/0100 VUs, 2397 complete and 0 interrupted iterations
hot_post_view   [  15% ] 0000/0100 VUs  0m12.0s/1m20s  0200.00 iters/s

running (0m13.0s), 0001/0100 VUs, 2596 complete and 0 interrupted iterations
hot_post_view   [  16% ] 0001/0100 VUs  0m13.0s/1m20s  0200.00 iters/s

running (0m14.0s), 0001/0100 VUs, 2796 complete and 0 interrupted iterations
hot_post_view   [  17% ] 0001/0100 VUs  0m14.0s/1m20s  0200.00 iters/s

running (0m15.0s), 0001/0100 VUs, 2996 complete and 0 interrupted iterations
hot_post_view   [  19% ] 0001/0100 VUs  0m15.0s/1m20s  0200.00 iters/s

running (0m16.0s), 0002/0100 VUs, 3201 complete and 0 interrupted iterations
hot_post_view   [  20% ] 0003/0100 VUs  0m16.0s/1m20s  0211.92 iters/s

running (0m17.0s), 0001/0100 VUs, 3420 complete and 0 interrupted iterations
hot_post_view   [  21% ] 0001/0100 VUs  0m17.0s/1m20s  0223.87 iters/s

running (0m18.0s), 0000/0100 VUs, 3650 complete and 0 interrupted iterations
hot_post_view   [  22% ] 0000/0100 VUs  0m18.0s/1m20s  0235.82 iters/s

running (0m19.0s), 0001/0100 VUs, 3892 complete and 0 interrupted iterations
hot_post_view   [  24% ] 0001/0100 VUs  0m19.0s/1m20s  0247.88 iters/s

running (0m20.0s), 0000/0100 VUs, 4146 complete and 0 interrupted iterations
hot_post_view   [  25% ] 0000/0100 VUs  0m20.0s/1m20s  0259.84 iters/s

running (0m21.0s), 0001/0100 VUs, 4411 complete and 0 interrupted iterations
hot_post_view   [  26% ] 0001/0100 VUs  0m21.0s/1m20s  0271.85 iters/s

running (0m22.0s), 0001/0100 VUs, 4689 complete and 0 interrupted iterations
hot_post_view   [  27% ] 0001/0100 VUs  0m22.0s/1m20s  0283.85 iters/s

running (0m23.0s), 0000/0100 VUs, 4979 complete and 0 interrupted iterations
hot_post_view   [  29% ] 0000/0100 VUs  0m23.0s/1m20s  0295.86 iters/s

running (0m24.0s), 0001/0100 VUs, 5281 complete and 0 interrupted iterations
hot_post_view   [  30% ] 0001/0100 VUs  0m24.0s/1m20s  0307.86 iters/s

running (0m25.0s), 0001/0100 VUs, 5594 complete and 0 interrupted iterations
hot_post_view   [  31% ] 0001/0100 VUs  0m25.0s/1m20s  0319.83 iters/s

running (0m26.0s), 0000/0100 VUs, 5921 complete and 0 interrupted iterations
hot_post_view   [  32% ] 0000/0100 VUs  0m26.0s/1m20s  0331.84 iters/s

running (0m27.0s), 0001/0100 VUs, 6258 complete and 0 interrupted iterations
hot_post_view   [  34% ] 0001/0100 VUs  0m27.0s/1m20s  0343.84 iters/s

running (0m28.0s), 0001/0100 VUs, 6608 complete and 0 interrupted iterations
hot_post_view   [  35% ] 0001/0100 VUs  0m28.0s/1m20s  0355.85 iters/s

running (0m29.0s), 0001/0100 VUs, 6970 complete and 0 interrupted iterations
hot_post_view   [  36% ] 0001/0100 VUs  0m29.0s/1m20s  0367.85 iters/s

running (0m30.0s), 0001/0100 VUs, 7344 complete and 0 interrupted iterations
hot_post_view   [  37% ] 0001/0100 VUs  0m30.0s/1m20s  0379.86 iters/s

running (0m31.0s), 0000/0100 VUs, 7730 complete and 0 interrupted iterations
hot_post_view   [  39% ] 0000/0100 VUs  0m31.0s/1m20s  0391.83 iters/s

running (0m32.0s), 0001/0100 VUs, 8128 complete and 0 interrupted iterations
hot_post_view   [  40% ] 0001/0100 VUs  0m32.0s/1m20s  0403.87 iters/s

running (0m33.0s), 0001/0100 VUs, 8537 complete and 0 interrupted iterations
hot_post_view   [  41% ] 0001/0100 VUs  0m33.0s/1m20s  0415.84 iters/s

running (0m34.0s), 0001/0100 VUs, 8959 complete and 0 interrupted iterations
hot_post_view   [  42% ] 0001/0100 VUs  0m34.0s/1m20s  0427.85 iters/s

running (0m35.0s), 0001/0100 VUs, 9393 complete and 0 interrupted iterations
hot_post_view   [  44% ] 0001/0100 VUs  0m35.0s/1m20s  0439.85 iters/s

running (0m36.0s), 0000/0100 VUs, 9839 complete and 0 interrupted iterations
hot_post_view   [  45% ] 0001/0100 VUs  0m36.0s/1m20s  0451.85 iters/s

running (0m37.0s), 0002/0100 VUs, 10296 complete and 0 interrupted iterations
hot_post_view   [  46% ] 0002/0100 VUs  0m37.0s/1m20s  0463.86 iters/s

running (0m38.0s), 0002/0100 VUs, 10766 complete and 0 interrupted iterations
hot_post_view   [  47% ] 0002/0100 VUs  0m38.0s/1m20s  0475.86 iters/s

running (0m39.0s), 0001/0100 VUs, 11248 complete and 0 interrupted iterations
hot_post_view   [  49% ] 0001/0100 VUs  0m39.0s/1m20s  0487.84 iters/s

running (0m40.0s), 0002/0100 VUs, 11741 complete and 0 interrupted iterations
hot_post_view   [  50% ] 0002/0100 VUs  0m40.0s/1m20s  0499.84 iters/s

running (0m41.0s), 0001/0100 VUs, 12251 complete and 0 interrupted iterations
hot_post_view   [  51% ] 0001/0100 VUs  0m41.0s/1m20s  0516.48 iters/s

running (0m42.0s), 0001/0100 VUs, 12775 complete and 0 interrupted iterations
hot_post_view   [  52% ] 0001/0100 VUs  0m42.0s/1m20s  0533.12 iters/s

running (0m43.0s), 0000/0100 VUs, 13317 complete and 0 interrupted iterations
hot_post_view   [  54% ] 0000/0100 VUs  0m43.0s/1m20s  0549.77 iters/s

running (0m44.0s), 0001/0100 VUs, 13875 complete and 0 interrupted iterations
hot_post_view   [  55% ] 0001/0100 VUs  0m44.0s/1m20s  0566.47 iters/s

running (0m45.0s), 0001/0100 VUs, 14449 complete and 0 interrupted iterations
hot_post_view   [  56% ] 0001/0100 VUs  0m45.0s/1m20s  0583.11 iters/s

running (0m46.0s), 0002/0100 VUs, 15040 complete and 0 interrupted iterations
hot_post_view   [  57% ] 0002/0100 VUs  0m46.0s/1m20s  0599.79 iters/s

running (0m47.0s), 0001/0100 VUs, 15649 complete and 0 interrupted iterations
hot_post_view   [  59% ] 0001/0100 VUs  0m47.0s/1m20s  0616.45 iters/s

running (0m48.0s), 0002/0100 VUs, 16273 complete and 0 interrupted iterations
hot_post_view   [  60% ] 0002/0100 VUs  0m48.0s/1m20s  0633.13 iters/s

running (0m49.0s), 0002/0100 VUs, 16914 complete and 0 interrupted iterations
hot_post_view   [  61% ] 0002/0100 VUs  0m49.0s/1m20s  0649.78 iters/s

running (0m50.0s), 0001/0100 VUs, 17573 complete and 0 interrupted iterations
hot_post_view   [  62% ] 0001/0100 VUs  0m50.0s/1m20s  0666.45 iters/s

running (0m51.0s), 0001/0100 VUs, 18247 complete and 0 interrupted iterations
hot_post_view   [  64% ] 0002/0100 VUs  0m51.0s/1m20s  0683.12 iters/s

running (0m52.0s), 0001/0100 VUs, 18939 complete and 0 interrupted iterations
hot_post_view   [  65% ] 0001/0100 VUs  0m52.0s/1m20s  0699.77 iters/s

running (0m53.0s), 0002/0100 VUs, 19647 complete and 0 interrupted iterations
hot_post_view   [  66% ] 0002/0100 VUs  0m53.0s/1m20s  0716.46 iters/s

running (0m54.0s), 0002/0100 VUs, 20372 complete and 0 interrupted iterations
hot_post_view   [  67% ] 0002/0100 VUs  0m54.0s/1m20s  0733.13 iters/s

running (0m55.0s), 0002/0100 VUs, 21113 complete and 0 interrupted iterations
hot_post_view   [  69% ] 0002/0100 VUs  0m55.0s/1m20s  0749.79 iters/s

running (0m56.0s), 0002/0100 VUs, 21871 complete and 0 interrupted iterations
hot_post_view   [  70% ] 0002/0100 VUs  0m56.0s/1m20s  0766.45 iters/s

running (0m57.0s), 0002/0100 VUs, 22646 complete and 0 interrupted iterations
hot_post_view   [  71% ] 0002/0100 VUs  0m57.0s/1m20s  0783.12 iters/s

running (0m58.0s), 0001/0100 VUs, 23438 complete and 0 interrupted iterations
hot_post_view   [  72% ] 0001/0100 VUs  0m58.0s/1m20s  0799.78 iters/s

running (0m59.0s), 0002/0100 VUs, 24245 complete and 0 interrupted iterations
hot_post_view   [  74% ] 0002/0100 VUs  0m59.0s/1m20s  0816.45 iters/s

running (1m00.0s), 0001/0100 VUs, 25070 complete and 0 interrupted iterations
hot_post_view   [  75% ] 0001/0100 VUs  1m00.0s/1m20s  0833.10 iters/s

running (1m01.0s), 0002/0100 VUs, 25911 complete and 0 interrupted iterations
hot_post_view   [  76% ] 0002/0100 VUs  1m01.0s/1m20s  0849.77 iters/s

running (1m02.0s), 0002/0100 VUs, 26769 complete and 0 interrupted iterations
hot_post_view   [  77% ] 0002/0100 VUs  1m02.0s/1m20s  0866.44 iters/s

running (1m03.0s), 0001/0100 VUs, 27645 complete and 0 interrupted iterations
hot_post_view   [  79% ] 0001/0100 VUs  1m03.0s/1m20s  0883.13 iters/s

running (1m04.0s), 0001/0100 VUs, 28537 complete and 0 interrupted iterations
hot_post_view   [  80% ] 0001/0100 VUs  1m04.0s/1m20s  0899.79 iters/s

running (1m05.0s), 0003/0100 VUs, 29443 complete and 0 interrupted iterations
hot_post_view   [  81% ] 0003/0100 VUs  1m05.0s/1m20s  0916.45 iters/s

running (1m06.0s), 0002/0100 VUs, 30368 complete and 0 interrupted iterations
hot_post_view   [  82% ] 0002/0100 VUs  1m06.0s/1m20s  0933.10 iters/s

running (1m07.0s), 0003/0100 VUs, 31309 complete and 0 interrupted iterations
hot_post_view   [  84% ] 0003/0100 VUs  1m07.0s/1m20s  0949.78 iters/s

running (1m08.0s), 0003/0100 VUs, 32268 complete and 0 interrupted iterations
hot_post_view   [  85% ] 0003/0100 VUs  1m08.0s/1m20s  0966.46 iters/s

running (1m09.0s), 0002/0100 VUs, 33243 complete and 0 interrupted iterations
hot_post_view   [  86% ] 0002/0100 VUs  1m09.0s/1m20s  0983.13 iters/s

running (1m10.0s), 0002/0100 VUs, 34235 complete and 0 interrupted iterations
hot_post_view   [  87% ] 0002/0100 VUs  1m10.0s/1m20s  0999.79 iters/s

running (1m11.0s), 0001/0100 VUs, 35186 complete and 0 interrupted iterations
hot_post_view   [  89% ] 0001/0100 VUs  1m11.0s/1m20s  0901.28 iters/s

running (1m12.0s), 0002/0100 VUs, 36037 complete and 0 interrupted iterations
hot_post_view   [  90% ] 0002/0100 VUs  1m12.0s/1m20s  0801.31 iters/s

running (1m13.0s), 0001/0100 VUs, 36790 complete and 0 interrupted iterations
hot_post_view   [  91% ] 0001/0100 VUs  1m13.0s/1m20s  0701.21 iters/s

running (1m14.0s), 0001/0100 VUs, 37441 complete and 0 interrupted iterations
hot_post_view   [  92% ] 0001/0100 VUs  1m14.0s/1m20s  0601.25 iters/s

running (1m15.0s), 0001/0100 VUs, 37992 complete and 0 interrupted iterations
hot_post_view   [  94% ] 0001/0100 VUs  1m15.0s/1m20s  0501.30 iters/s

running (1m16.0s), 0002/0100 VUs, 38443 complete and 0 interrupted iterations
hot_post_view   [  95% ] 0002/0100 VUs  1m16.0s/1m20s  0401.12 iters/s

running (1m17.0s), 0001/0100 VUs, 38795 complete and 0 interrupted iterations
hot_post_view   [  96% ] 0001/0100 VUs  1m17.0s/1m20s  0301.16 iters/s

running (1m18.0s), 0001/0100 VUs, 39046 complete and 0 interrupted iterations
hot_post_view   [  97% ] 0001/0100 VUs  1m18.0s/1m20s  0201.25 iters/s

running (1m19.0s), 0000/0100 VUs, 39198 complete and 0 interrupted iterations
hot_post_view   [  99% ] 0000/0100 VUs  1m19.0s/1m20s  0101.49 iters/s

running (1m20.0s), 0000/0100 VUs, 39249 complete and 0 interrupted iterations
hot_post_view   [ 100% ] 0000/0100 VUs  1m20.0s/1m20s  0007.07 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 39250   490.513176/s
    checks_succeeded...: 100.00% 39250 out of 39250
    checks_failed......: 0.00%   0 out of 39250

    ✓ status is 200

    CUSTOM
    http_status_200................: 39250  490.513176/s

    HTTP
    http_req_duration..............: avg=2.21ms min=1.35ms med=1.89ms p(90)=2.42ms p(95)=2.98ms p(99)=8.24ms max=94.32ms
      { expected_response:true }...: avg=2.21ms min=1.35ms med=1.89ms p(90)=2.42ms p(95)=2.98ms p(99)=8.24ms max=94.32ms
    http_req_failed................: 0.00%  0 out of 39250
    http_reqs......................: 39250  490.513176/s

    EXECUTION
    iteration_duration.............: avg=2.27ms min=1.4ms  med=1.94ms p(90)=2.49ms p(95)=3.07ms p(99)=8.4ms  max=94.43ms
    iterations.....................: 39250  490.513176/s
    vus............................: 0      min=0          max=3  
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 747 MB 9.3 MB/s
    data_sent......................: 11 MB  131 kB/s



running (1m20.0s), 0000/0100 VUs, 39250 complete and 0 interrupted iterations
hot_post_view ✓ [ 100% ] 0000/0100 VUs  1m20s  0007.07 iters/s